cases/flatPlate/kOmegaDavidsonNN/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          52;
        startFace       15398;
    }
    outlet
    {
        type            patch;
        nFaces          52;
        startFace       15450;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       15502;
    }
    top
    {
        type            patch;
        nFaces          150;
        startFace       15652;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7800;
        startFace       15802;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7800;
        startFace       23602;
    }
)

// ************************************************************************* //
