cases/flatPlate/kOmegaDavidsonNN/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
7800
(
0.0030666667
0.0092
0.015333333
0.021466667
0.0276
0.033733333
0.039866667
0.046
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
0.92
0.92
0.92
0.92
0.92
0.92
0.92
0.92
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
0.0030666667
0.0092
0.015333333
0.021466667
0.0276
0.033733333
0.039866667
0.046
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
0.0030666667
0.0092
0.015333333
0.021466667
0.0276
0.033733333
0.039866667
0.046
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
