cases/flatPlate/kOmegaDavidsonNN/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
7800
(
7.506113e-05
7.506113e-05
7.506113e-05
7.506113e-05
7.506113e-05
7.506113e-05
7.506113e-05
7.506113e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
7.506113e-05
0.00023268787
0.00040607387
0.0005967947
0.00080658347
0.0010373466
0.001291181
0.0015703933
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
52
(
7.506113e-05
0.00023268787
0.00040607387
0.0005967947
0.00080658347
0.0010373466
0.001291181
0.0015703933
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
0.211564
0.211564
0.211564
0.211564
0.211564
0.211564
0.211564
0.211564
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
